# Employees Data

In [22]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
csv1 = "../Data/departments.csv"
csv2 = "../Data/dept_emp.csv"
csv3 = "../Data/dept_manager.csv"
csv4 = "../Data/employees.csv"
csv5 = "../Data/salaries.csv"
csv6 = "../Data/titles.csv"

## Data Engineering

### Check CSVs
* checking if "id" column values are unique, 
* looking for duplicates, 
* check if any table needs composite keys, etc.

In [3]:
data_dep = pd.read_csv(csv1)
data_dep

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [4]:
data_emp_dep = pd.read_csv(csv2)
data_emp_dep

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]

In [5]:
# checking if emp_no is unique   ### FALSE 
data_emp_dep["emp_no"].count() == data_emp_dep["emp_no"].nunique()

False

In [6]:
data_emp_dep["emp_no"].count()

331603

In [7]:
data_emp_dep["emp_no"].nunique()

300024

In [8]:
group_emp = data_emp_dep.groupby(by="emp_no").count()

In [9]:
group_emp=group_emp.reset_index()

In [10]:
# looking for duplicated cases
group_emp.loc[group_emp["dept_no"] > 1, :]

        emp_no  dept_no
9        10010        2
17       10018        2
28       10029        2
39       10040        2
49       10050        2
...        ...      ...
299979  499955        2
299988  499964        2
299999  499975        2
300007  499983        2
300016  499992        2

[31579 rows x 2 columns]

In [11]:
# checking if duplicated employees have same dept or dif == DIF  /// create COMP KEY
data_emp_dep.loc[data_emp_dep["emp_no"] == 10018, :]

    emp_no dept_no
18   10018    d004
19   10018    d005

In [12]:
data_emp_dep_2 = pd.read_csv(csv3)
data_emp_dep_2

   dept_no  emp_no
0     d001  110022
1     d001  110039
2     d002  110085
3     d002  110114
4     d003  110183
5     d003  110228
6     d004  110303
7     d004  110344
8     d004  110386
9     d004  110420
10    d005  110511
11    d005  110567
12    d006  110725
13    d006  110765
14    d006  110800
15    d006  110854
16    d007  111035
17    d007  111133
18    d008  111400
19    d008  111534
20    d009  111692
21    d009  111784
22    d009  111877
23    d009  111939

In [13]:
# checking if emp_no is unique
data_emp_dep_2["emp_no"].count() == data_emp_dep_2["emp_no"].nunique()

True

In [14]:
data_emp = pd.read_csv(csv4)
data_emp

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991
...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,10/28/1988
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,2/26/1995
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,2/24/1988
300022,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,11/23/1987

In [15]:
# checking if emp_no is unique
data_emp["emp_no"].count() == data_emp["emp_no"].nunique()

True

In [16]:
data_emp_sal = pd.read_csv(csv5)
data_emp_sal

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [17]:
# checking if emp_no is unique
data_emp_sal["emp_no"].count() == data_emp_sal["emp_no"].nunique()

True

In [18]:
data_title = pd.read_csv(csv6)
data_title

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

## ERD Diagram


Department
-
dept_no PK string
dept_name UNIQUE string


Dept_Manager
-
dept_no string FK - Department.dept_no
emp_no PK int


Title
-
title_id PK string
title UNIQUE string


Employee
-
emp_no PK int
emp_title_id string FK >- Title.title_id
birth_date date 
first_name string
last_name string
sex char 
hire_date date


Salary
-
emp_no PK int FK - Employee.emp_no
salary money


((331603 rows without unique values / PK
((emp_no + dept_no = No Duplicated = Composite PKey
Dept_Emp
-
emp_no PK int FK >-< Employee.emp_no
dept_no PK string FK >-< Department.dept_no

## Create Tables


CREATE TABLE "Department" (
    "dept_no" VARCHAR(50)   NOT NULL,
    "dept_name" VARCHAR(50)   NOT NULL UNIQUE,
    PRIMARY KEY (
        "dept_no"
     )
);


CREATE TABLE "Dept_Manager" (
    "dept_no" VARCHAR(50)   NOT NULL,
    "emp_no" INTEGER   NOT NULL,
    PRIMARY KEY (
        "emp_no"
     ),
    FOREIGN KEY("dept_no") REFERENCES "Department" ("dept_no")
);


CREATE TABLE "Title" (
    "title_id" VARCHAR(50)   NOT NULL,
    "title" VARCHAR(50)   NOT NULL UNIQUE,
    PRIMARY KEY (
        "title_id"
     )
);


CREATE TABLE "Employee" (
    "emp_no" INTEGER   NOT NULL,
    "emp_title_id" VARCHAR(50)   NOT NULL,
    "birth_DATE" DATE   NOT NULL,
    "first_name" VARCHAR(50)   NOT NULL,
    "last_name" VARCHAR(50)   NOT NULL,
    "sex" CHAR   NOT NULL,
    "hire_DATE" DATE   NOT NULL,
    PRIMARY KEY (
        "emp_no"
     ),
    FOREIGN KEY("emp_title_id") REFERENCES "Title" ("title_id")
);


CREATE TABLE "Salary" (
    "emp_no" INTEGER   NOT NULL,
    "salary" MONEY   NOT NULL,
    PRIMARY KEY (
        "emp_no"
     ),
    FOREIGN KEY("emp_no") REFERENCES "Employee" ("emp_no")
);


CREATE TABLE "Dept_Emp" (
    "emp_no" INTEGER   NOT NULL,
    "dept_no" VARCHAR(50)   NOT NULL,
    PRIMARY KEY (
        "emp_no","dept_no"
     ),
     FOREIGN KEY("emp_no") REFERENCES "Employee" ("emp_no"),
     FOREIGN KEY("dept_no") REFERENCES "Department" ("dept_no")
);

In [23]:
from pg_keys import pg_key

In [24]:
connection_string = (f'postgres:{pg_key}@localhost:5432/employee_db')
engine = create_engine(f'postgresql://{connection_string}')

In [25]:
engine.table_names()

C:\Users\Didi\AppData\Local\Temp/ipykernel_12584/4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['Department', 'Dept_Manager', 'Title', 'Employee', 'Salary', 'Dept_Emp']

In [ ]:
#clean_df.to_sql(name='civilians', con=engine, if_exists='append', index=False)

In [ ]:
#pd.read_sql_query('select * from civilians', con=engine).head()